app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <li>
      <%= User.find(invitation.user_id).fullname %>