app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    signed_in? ? User.find(session[:current_user_id]) : nil