app/helpers/users_helper.rb

  def current_user_is_doctor(current_user_id, doctor_id)
    relationship = ContactWithDoc.find_by(patient_id: current_user_id, doctor_id: doctor_id)
---
SELECT "contact_with_docs".* FROM "contact_with_docs" WHERE "contact_with_docs"."patient_id" = $1 AND "contact_with_docs"."doctor_id" = $2 LIMIT $3  [["patient_id", 1], ["doctor_id", 13], ["LIMIT", 1]]