app/controllers/invitations_controller.rb

INSERT INTO "invitations" ("user_id", "doc_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["doc_id", 2], ["created_at", "2021-11-20 20:34:34.463221"], ["updated_at", "2021-11-20 20:34:34.463221"]]
---
    def create
        id1 = params[:ids][:id1]
        id2 = params[:ids][:id2]
        @invitation = Invitation.new(user_id: id1, doc_id: id2)
        @invitation.save

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "invitations" WHERE "invitations"."id" = $1  [["id", 7]]
---
      def destroy
        invitation = Invitation.find(params[:invitation_id])
        invitation.destroy

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "invitations" SET "confirmed" = $1, "updated_at" = $2 WHERE "invitations"."id" = $3  [["confirmed", true], ["updated_at", "2021-11-20 20:20:45.475504"], ["id", 1]]
---
      def update
        invitation = Invitation.find(params[:invitation_id])
        p current_user
        invitation.update(confirmed: true)