app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def create
    @user = User.find_by! id: params[:id]