app/controllers/roles_controller.rb

INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Patient"], ["description", ""], ["created_at", "2021-11-20 20:39:46.496770"], ["updated_at", "2021-11-20 20:39:46.496770"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save