app/controllers/sessions_controller.rb

    def new
        @user = User.new
        @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC

      def create
        fullname = params[:user][:fullname]
        @user = User.find_by(fullname: fullname)
---
SELECT "users".* FROM "users" WHERE "users"."fullname" = $1 LIMIT $2  [["fullname", "Oksana Petrova"], ["LIMIT", 1]]