app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fullname", "created_at", "updated_at", "role_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fullname", "Norton (admin created)"], ["created_at", "2021-11-20 22:05:58.708355"], ["updated_at", "2021-11-20 22:05:58.708355"], ["role_id", 2]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "role_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-11-20 21:19:19.935974"], ["role_id", 1], ["id", 1]]

  def book
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def unbook
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]