app/models/invitation.rb

  def self.reacted?(id1, id2)
    case1 = !Invitation.where(user_id: id1, doc_id: id2).empty?
    case2 = !Invitation.where(user_id: id2, doc_id: id1).empty?
---
SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = $1 AND "invitations"."doc_id" = $2 LIMIT $3  [["user_id", 1], ["doc_id", 1], ["LIMIT", 1]]

  def self.find_invitation(id1, id2)
    if Invitation.where(user_id: id1, doc_id: id2, confirmed: true).empty?
      Invitation.where(user_id: id2, doc_id: id1, confirmed: true)[0].id
    else
      Invitation.where(user_id: id1, doc_id: id2, confirmed: true)[0].id
---
SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = $1 AND "invitations"."doc_id" = $2 AND "invitations"."confirmed" = $3 LIMIT $4  [["user_id", 1], ["doc_id", 6], ["confirmed", true], ["LIMIT", 1]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."user_id" = $1 AND "invitations"."doc_id" = $2 AND "invitations"."confirmed" = $3  [["user_id", 1], ["doc_id", 6], ["confirmed", true]]