app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def assign_role
    self.role = Role.find_by name: 'Patient' if role.nil?