app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Patient"], ["LIMIT", 1]]
---
  def assign_role
    self.role = Role.find_by name: 'Patient' if role.nil?

SELECT "invitations"."user_id" FROM "invitations" WHERE "invitations"."doc_id" = $1 AND "invitations"."confirmed" = $2  [["doc_id", 1], ["confirmed", true]]
---
    def docs
      docs_i_sent_invitation = Invitation.where(user_id: id, confirmed: true).pluck(:doc_id)